espressif/esp-idf/components/soc/esp32s31/register/soc/hp_apm_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** HP_APM_REGION_FILTER_EN_REG register
 *  Region filter enable register
 */
#define HP_APM_REGION_FILTER_EN_REG (DR_REG_HP_APM_BASE + 0x0)
/** HP_APM_REGION_FILTER_EN : R/W; bitpos: [15:0]; default: 1;
 *  Configure bit $n (0-15) to enable region $n.
 *  0: disable
 *  1: enable
 */
#define HP_APM_REGION_FILTER_EN    0x0000FFFFU
#define HP_APM_REGION_FILTER_EN_M  (HP_APM_REGION_FILTER_EN_V << HP_APM_REGION_FILTER_EN_S)
#define HP_APM_REGION_FILTER_EN_V  0x0000FFFFU
#define HP_APM_REGION_FILTER_EN_S  0

/** HP_APM_REGION0_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION0_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x4)
/** HP_APM_REGION0_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 0.
 */
#define HP_APM_REGION0_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION0_ADDR_START_M  (HP_APM_REGION0_ADDR_START_V << HP_APM_REGION0_ADDR_START_S)
#define HP_APM_REGION0_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION0_ADDR_START_S  0

/** HP_APM_REGION0_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION0_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x8)
/** HP_APM_REGION0_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 0.
 */
#define HP_APM_REGION0_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION0_ADDR_END_M  (HP_APM_REGION0_ADDR_END_V << HP_APM_REGION0_ADDR_END_S)
#define HP_APM_REGION0_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION0_ADDR_END_S  0

/** HP_APM_REGION0_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION0_ATTR_REG (DR_REG_HP_APM_BASE + 0xc)
/** HP_APM_REGION0_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 0.
 */
#define HP_APM_REGION0_R0_X    (BIT(0))
#define HP_APM_REGION0_R0_X_M  (HP_APM_REGION0_R0_X_V << HP_APM_REGION0_R0_X_S)
#define HP_APM_REGION0_R0_X_V  0x00000001U
#define HP_APM_REGION0_R0_X_S  0
/** HP_APM_REGION0_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 0.
 */
#define HP_APM_REGION0_R0_W    (BIT(1))
#define HP_APM_REGION0_R0_W_M  (HP_APM_REGION0_R0_W_V << HP_APM_REGION0_R0_W_S)
#define HP_APM_REGION0_R0_W_V  0x00000001U
#define HP_APM_REGION0_R0_W_S  1
/** HP_APM_REGION0_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 0.
 */
#define HP_APM_REGION0_R0_R    (BIT(2))
#define HP_APM_REGION0_R0_R_M  (HP_APM_REGION0_R0_R_V << HP_APM_REGION0_R0_R_S)
#define HP_APM_REGION0_R0_R_V  0x00000001U
#define HP_APM_REGION0_R0_R_S  2
/** HP_APM_REGION0_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 0.
 */
#define HP_APM_REGION0_R1_X    (BIT(4))
#define HP_APM_REGION0_R1_X_M  (HP_APM_REGION0_R1_X_V << HP_APM_REGION0_R1_X_S)
#define HP_APM_REGION0_R1_X_V  0x00000001U
#define HP_APM_REGION0_R1_X_S  4
/** HP_APM_REGION0_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 0.
 */
#define HP_APM_REGION0_R1_W    (BIT(5))
#define HP_APM_REGION0_R1_W_M  (HP_APM_REGION0_R1_W_V << HP_APM_REGION0_R1_W_S)
#define HP_APM_REGION0_R1_W_V  0x00000001U
#define HP_APM_REGION0_R1_W_S  5
/** HP_APM_REGION0_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 0.
 */
#define HP_APM_REGION0_R1_R    (BIT(6))
#define HP_APM_REGION0_R1_R_M  (HP_APM_REGION0_R1_R_V << HP_APM_REGION0_R1_R_S)
#define HP_APM_REGION0_R1_R_V  0x00000001U
#define HP_APM_REGION0_R1_R_S  6
/** HP_APM_REGION0_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 0.
 */
#define HP_APM_REGION0_R2_X    (BIT(8))
#define HP_APM_REGION0_R2_X_M  (HP_APM_REGION0_R2_X_V << HP_APM_REGION0_R2_X_S)
#define HP_APM_REGION0_R2_X_V  0x00000001U
#define HP_APM_REGION0_R2_X_S  8
/** HP_APM_REGION0_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 0.
 */
#define HP_APM_REGION0_R2_W    (BIT(9))
#define HP_APM_REGION0_R2_W_M  (HP_APM_REGION0_R2_W_V << HP_APM_REGION0_R2_W_S)
#define HP_APM_REGION0_R2_W_V  0x00000001U
#define HP_APM_REGION0_R2_W_S  9
/** HP_APM_REGION0_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 0.
 */
#define HP_APM_REGION0_R2_R    (BIT(10))
#define HP_APM_REGION0_R2_R_M  (HP_APM_REGION0_R2_R_V << HP_APM_REGION0_R2_R_S)
#define HP_APM_REGION0_R2_R_V  0x00000001U
#define HP_APM_REGION0_R2_R_S  10
/** HP_APM_REGION0_TEE_X : R/W; bitpos: [12]; default: 1;
 *  Configures the execution authority of TEE_MODE in region 0.
 */
#define HP_APM_REGION0_TEE_X    (BIT(12))
#define HP_APM_REGION0_TEE_X_M  (HP_APM_REGION0_TEE_X_V << HP_APM_REGION0_TEE_X_S)
#define HP_APM_REGION0_TEE_X_V  0x00000001U
#define HP_APM_REGION0_TEE_X_S  12
/** HP_APM_REGION0_TEE_W : R/W; bitpos: [13]; default: 1;
 *  Configures the write authority of TEE_MODE in region 0.
 */
#define HP_APM_REGION0_TEE_W    (BIT(13))
#define HP_APM_REGION0_TEE_W_M  (HP_APM_REGION0_TEE_W_V << HP_APM_REGION0_TEE_W_S)
#define HP_APM_REGION0_TEE_W_V  0x00000001U
#define HP_APM_REGION0_TEE_W_S  13
/** HP_APM_REGION0_TEE_R : R/W; bitpos: [14]; default: 1;
 *  Configures the read authority of TEE_MODE in region 0.
 */
#define HP_APM_REGION0_TEE_R    (BIT(14))
#define HP_APM_REGION0_TEE_R_M  (HP_APM_REGION0_TEE_R_V << HP_APM_REGION0_TEE_R_S)
#define HP_APM_REGION0_TEE_R_V  0x00000001U
#define HP_APM_REGION0_TEE_R_S  14
/** HP_APM_REGION0_LOCK : R/W; bitpos: [16]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_APM_REGION0_LOCK    (BIT(16))
#define HP_APM_REGION0_LOCK_M  (HP_APM_REGION0_LOCK_V << HP_APM_REGION0_LOCK_S)
#define HP_APM_REGION0_LOCK_V  0x00000001U
#define HP_APM_REGION0_LOCK_S  16

/** HP_APM_REGION1_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION1_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x10)
/** HP_APM_REGION1_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures start address of region 1.
 */
#define HP_APM_REGION1_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION1_ADDR_START_M  (HP_APM_REGION1_ADDR_START_V << HP_APM_REGION1_ADDR_START_S)
#define HP_APM_REGION1_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION1_ADDR_START_S  0

/** HP_APM_REGION1_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION1_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x14)
/** HP_APM_REGION1_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures end address of region 1.
 */
#define HP_APM_REGION1_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION1_ADDR_END_M  (HP_APM_REGION1_ADDR_END_V << HP_APM_REGION1_ADDR_END_S)
#define HP_APM_REGION1_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION1_ADDR_END_S  0

