espressif/esp-idf/components/soc/esp32s31/register/soc/hp_apm_reg.h
/** HP_APM_M5_EXCEPTION_INFO1_REG register
 *  M5 exception_info1 register
 */
#define HP_APM_M5_EXCEPTION_INFO1_REG (DR_REG_HP_APM_BASE + 0x124)
/** HP_APM_M5_EXCEPTION_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents exception addr.
 */
#define HP_APM_M5_EXCEPTION_ADDR    0xFFFFFFFFU
#define HP_APM_M5_EXCEPTION_ADDR_M  (HP_APM_M5_EXCEPTION_ADDR_V << HP_APM_M5_EXCEPTION_ADDR_S)
#define HP_APM_M5_EXCEPTION_ADDR_V  0xFFFFFFFFU
#define HP_APM_M5_EXCEPTION_ADDR_S  0

/** HP_APM_M6_STATUS_REG register
 *  M6 status register
 */
#define HP_APM_M6_STATUS_REG (DR_REG_HP_APM_BASE + 0x12c)
/** HP_APM_M6_EXCEPTION_STATUS : RO; bitpos: [1:0]; default: 0;
 *  Represents exception status.
 *  bit0: 1 represents authority_exception
 *  bit1: 1 represents space_exception
 */
#define HP_APM_M6_EXCEPTION_STATUS    0x00000003U
#define HP_APM_M6_EXCEPTION_STATUS_M  (HP_APM_M6_EXCEPTION_STATUS_V << HP_APM_M6_EXCEPTION_STATUS_S)
#define HP_APM_M6_EXCEPTION_STATUS_V  0x00000003U
#define HP_APM_M6_EXCEPTION_STATUS_S  0

/** HP_APM_M6_STATUS_CLR_REG register
 *  M6 status clear register
 */
#define HP_APM_M6_STATUS_CLR_REG (DR_REG_HP_APM_BASE + 0x130)
/** HP_APM_M6_EXCEPTION_STATUS_CLR : WT; bitpos: [0]; default: 0;
 *  Configures to clear exception status.
 */
#define HP_APM_M6_EXCEPTION_STATUS_CLR    (BIT(0))
#define HP_APM_M6_EXCEPTION_STATUS_CLR_M  (HP_APM_M6_EXCEPTION_STATUS_CLR_V << HP_APM_M6_EXCEPTION_STATUS_CLR_S)
#define HP_APM_M6_EXCEPTION_STATUS_CLR_V  0x00000001U
#define HP_APM_M6_EXCEPTION_STATUS_CLR_S  0

/** HP_APM_M6_EXCEPTION_INFO0_REG register
 *  M6 exception_info0 register
 */
#define HP_APM_M6_EXCEPTION_INFO0_REG (DR_REG_HP_APM_BASE + 0x134)
/** HP_APM_M6_EXCEPTION_REGION : RO; bitpos: [15:0]; default: 0;
 *  Represents exception region.
 */
#define HP_APM_M6_EXCEPTION_REGION    0x0000FFFFU
#define HP_APM_M6_EXCEPTION_REGION_M  (HP_APM_M6_EXCEPTION_REGION_V << HP_APM_M6_EXCEPTION_REGION_S)
#define HP_APM_M6_EXCEPTION_REGION_V  0x0000FFFFU
#define HP_APM_M6_EXCEPTION_REGION_S  0
/** HP_APM_M6_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Represents exception mode.
 */
#define HP_APM_M6_EXCEPTION_MODE    0x00000003U
#define HP_APM_M6_EXCEPTION_MODE_M  (HP_APM_M6_EXCEPTION_MODE_V << HP_APM_M6_EXCEPTION_MODE_S)
#define HP_APM_M6_EXCEPTION_MODE_V  0x00000003U
#define HP_APM_M6_EXCEPTION_MODE_S  16
/** HP_APM_M6_EXCEPTION_ID : RO; bitpos: [24:18]; default: 0;
 *  Represents exception id information.
 */
#define HP_APM_M6_EXCEPTION_ID    0x0000007FU
#define HP_APM_M6_EXCEPTION_ID_M  (HP_APM_M6_EXCEPTION_ID_V << HP_APM_M6_EXCEPTION_ID_S)
#define HP_APM_M6_EXCEPTION_ID_V  0x0000007FU
#define HP_APM_M6_EXCEPTION_ID_S  18

/** HP_APM_M6_EXCEPTION_INFO1_REG register
 *  M6 exception_info1 register
 */
#define HP_APM_M6_EXCEPTION_INFO1_REG (DR_REG_HP_APM_BASE + 0x138)
/** HP_APM_M6_EXCEPTION_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents exception addr.
 */
#define HP_APM_M6_EXCEPTION_ADDR    0xFFFFFFFFU
#define HP_APM_M6_EXCEPTION_ADDR_M  (HP_APM_M6_EXCEPTION_ADDR_V << HP_APM_M6_EXCEPTION_ADDR_S)
#define HP_APM_M6_EXCEPTION_ADDR_V  0xFFFFFFFFU
#define HP_APM_M6_EXCEPTION_ADDR_S  0

/** HP_APM_INT_EN_REG register
 *  APM interrupt enable register
 */
#define HP_APM_INT_EN_REG (DR_REG_HP_APM_BASE + 0x14c)
/** HP_APM_M0_APM_INT_EN : R/W; bitpos: [0]; default: 0;
 *  Configures to enable APM M0 interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_APM_M0_APM_INT_EN    (BIT(0))
#define HP_APM_M0_APM_INT_EN_M  (HP_APM_M0_APM_INT_EN_V << HP_APM_M0_APM_INT_EN_S)
#define HP_APM_M0_APM_INT_EN_V  0x00000001U
#define HP_APM_M0_APM_INT_EN_S  0
/** HP_APM_M1_APM_INT_EN : R/W; bitpos: [1]; default: 0;
 *  Configures to enable APM M1 interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_APM_M1_APM_INT_EN    (BIT(1))
#define HP_APM_M1_APM_INT_EN_M  (HP_APM_M1_APM_INT_EN_V << HP_APM_M1_APM_INT_EN_S)
#define HP_APM_M1_APM_INT_EN_V  0x00000001U
#define HP_APM_M1_APM_INT_EN_S  1
/** HP_APM_M2_APM_INT_EN : R/W; bitpos: [2]; default: 0;
 *  Configures to enable APM M2 interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_APM_M2_APM_INT_EN    (BIT(2))
#define HP_APM_M2_APM_INT_EN_M  (HP_APM_M2_APM_INT_EN_V << HP_APM_M2_APM_INT_EN_S)
#define HP_APM_M2_APM_INT_EN_V  0x00000001U
#define HP_APM_M2_APM_INT_EN_S  2
/** HP_APM_M3_APM_INT_EN : R/W; bitpos: [3]; default: 0;
 *  Configures to enable APM M3 interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_APM_M3_APM_INT_EN    (BIT(3))
#define HP_APM_M3_APM_INT_EN_M  (HP_APM_M3_APM_INT_EN_V << HP_APM_M3_APM_INT_EN_S)
#define HP_APM_M3_APM_INT_EN_V  0x00000001U
#define HP_APM_M3_APM_INT_EN_S  3
/** HP_APM_M4_APM_INT_EN : R/W; bitpos: [4]; default: 0;
 *  Configures to enable APM M4 interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_APM_M4_APM_INT_EN    (BIT(4))
#define HP_APM_M4_APM_INT_EN_M  (HP_APM_M4_APM_INT_EN_V << HP_APM_M4_APM_INT_EN_S)
#define HP_APM_M4_APM_INT_EN_V  0x00000001U
#define HP_APM_M4_APM_INT_EN_S  4
/** HP_APM_M5_APM_INT_EN : R/W; bitpos: [5]; default: 0;
 *  Configures to enable APM M5 interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_APM_M5_APM_INT_EN    (BIT(5))
#define HP_APM_M5_APM_INT_EN_M  (HP_APM_M5_APM_INT_EN_V << HP_APM_M5_APM_INT_EN_S)
#define HP_APM_M5_APM_INT_EN_V  0x00000001U
#define HP_APM_M5_APM_INT_EN_S  5
/** HP_APM_M6_APM_INT_EN : R/W; bitpos: [6]; default: 0;
 *  Configures to enable APM M6 interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_APM_M6_APM_INT_EN    (BIT(6))
#define HP_APM_M6_APM_INT_EN_M  (HP_APM_M6_APM_INT_EN_V << HP_APM_M6_APM_INT_EN_S)
#define HP_APM_M6_APM_INT_EN_V  0x00000001U
#define HP_APM_M6_APM_INT_EN_S  6

/** HP_APM_AXI_BLOCK_EN_REG register
 *  M6 status clear register
 */
#define HP_APM_AXI_BLOCK_EN_REG (DR_REG_HP_APM_BASE + 0x150)
/** HP_APM_AXI_BLOCK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures to if block transmission when get exceltion.
 *  0: transparent transmission to slave
 *  1: don't transparent transmission to slave
 */
#define HP_APM_AXI_BLOCK_EN    (BIT(0))
#define HP_APM_AXI_BLOCK_EN_M  (HP_APM_AXI_BLOCK_EN_V << HP_APM_AXI_BLOCK_EN_S)
#define HP_APM_AXI_BLOCK_EN_V  0x00000001U
#define HP_APM_AXI_BLOCK_EN_S  0

/** HP_APM_BUS_ERR_CONF_REG register
 *  APM interrupt enable register
 */
#define HP_APM_BUS_ERR_CONF_REG (DR_REG_HP_APM_BASE + 0x154)
/** HP_APM_BUS_ERR_RESP_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether return error response to cpu when access blocked
 *  0: disable error response
 *  1: enable error response
 */
#define HP_APM_BUS_ERR_RESP_EN    (BIT(0))
#define HP_APM_BUS_ERR_RESP_EN_M  (HP_APM_BUS_ERR_RESP_EN_V << HP_APM_BUS_ERR_RESP_EN_S)
#define HP_APM_BUS_ERR_RESP_EN_V  0x00000001U
#define HP_APM_BUS_ERR_RESP_EN_S  0

/** HP_APM_CLOCK_GATE_REG register
 *  Clock gating register
 */
#define HP_APM_CLOCK_GATE_REG (DR_REG_HP_APM_BASE + 0x3f8)
/** HP_APM_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: enable automatic clock gating
 *  1: keep the clock always on
 */
#define HP_APM_CLK_EN    (BIT(0))
#define HP_APM_CLK_EN_M  (HP_APM_CLK_EN_V << HP_APM_CLK_EN_S)
#define HP_APM_CLK_EN_V  0x00000001U
#define HP_APM_CLK_EN_S  0

/** HP_APM_DATE_REG register
 *  Version control register
 */
#define HP_APM_DATE_REG (DR_REG_HP_APM_BASE + 0x3fc)
/** HP_APM_DATE : R/W; bitpos: [27:0]; default: 38822496;
 *  Version control register.
 */
#define HP_APM_DATE    0x0FFFFFFFU
#define HP_APM_DATE_M  (HP_APM_DATE_V << HP_APM_DATE_S)
#define HP_APM_DATE_V  0x0FFFFFFFU
#define HP_APM_DATE_S  0

#ifdef __cplusplus
}
#endif
